RT-Thread/rt-thread/bsp/stm32/stm32h563-st-nucleo/board/CubeMX_Config/Drivers/STM32H5xx_HAL_Driver/Inc/stm32h5xx_ll_dma.h
/**
  * @brief  Get hardware request.
  * @note  This API is used for all available DMA channels.
  * @rmtoll CTR2         REQSEL     LL_DMA_GetPeriphRequest
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_0
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  *         @arg @ref LL_DMA_CHANNEL_7
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_GPDMA1_REQUEST_ADC1
  *         @arg @ref LL_GPDMA1_REQUEST_ADC2 (*)
  *         @arg @ref LL_GPDMA1_REQUEST_DAC1_CH1
  *         @arg @ref LL_GPDMA1_REQUEST_DAC1_CH2
  *         @arg @ref LL_GPDMA1_REQUEST_TIM6_UP
  *         @arg @ref LL_GPDMA1_REQUEST_TIM7_UP
  *         @arg @ref LL_GPDMA1_REQUEST_SPI1_RX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI1_TX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI2_RX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI2_TX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI3_RX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI3_TX
  *         @arg @ref LL_GPDMA1_REQUEST_I2C1_RX
  *         @arg @ref LL_GPDMA1_REQUEST_I2C1_TX
  *         @arg @ref LL_GPDMA1_REQUEST_I2C2_RX
  *         @arg @ref LL_GPDMA1_REQUEST_I2C2_TX
  *         @arg @ref LL_GPDMA1_REQUEST_I2C3_RX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_I2C3_TX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_USART1_RX
  *         @arg @ref LL_GPDMA1_REQUEST_USART1_TX
  *         @arg @ref LL_GPDMA1_REQUEST_USART2_RX
  *         @arg @ref LL_GPDMA1_REQUEST_USART2_TX
  *         @arg @ref LL_GPDMA1_REQUEST_USART3_RX
  *         @arg @ref LL_GPDMA1_REQUEST_USART3_TX
  *         @arg @ref LL_GPDMA1_REQUEST_UART4_RX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_UART4_TX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_UART5_RX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_UART5_TX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_USART6_RX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_USART6_TX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_UART7_RX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_UART7_TX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_UART8_RX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_UART8_TX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_UART9_RX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_UART9_TX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_USART10_RX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_USART10_TX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_USART11_RX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_USART11_TX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_UART12_RX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_UART12_TX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_LPUART1_RX
  *         @arg @ref LL_GPDMA1_REQUEST_LPUART1_TX
  *         @arg @ref LL_GPDMA1_REQUEST_SPI4_RX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_SPI4_TX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_SPI5_RX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_SPI5_TX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_SPI6_RX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_SPI6_TX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_SAI1_A (*)
  *         @arg @ref LL_GPDMA1_REQUEST_SAI1_B (*)
  *         @arg @ref LL_GPDMA1_REQUEST_SAI2_A (*)
  *         @arg @ref LL_GPDMA1_REQUEST_SAI2_B (*)
  *         @arg @ref LL_GPDMA1_REQUEST_OCTOSPI1 (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM1_CH1
  *         @arg @ref LL_GPDMA1_REQUEST_TIM1_CH2
  *         @arg @ref LL_GPDMA1_REQUEST_TIM1_CH3
  *         @arg @ref LL_GPDMA1_REQUEST_TIM1_CH4
  *         @arg @ref LL_GPDMA1_REQUEST_TIM1_UP
  *         @arg @ref LL_GPDMA1_REQUEST_TIM1_TRIG
  *         @arg @ref LL_GPDMA1_REQUEST_TIM1_COM
  *         @arg @ref LL_GPDMA1_REQUEST_TIM8_CH1 (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM8_CH2 (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM8_CH3 (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM8_CH4 (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM8_UP  (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM8_TRIG (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM8_COM (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM2_CH1
  *         @arg @ref LL_GPDMA1_REQUEST_TIM2_CH2
  *         @arg @ref LL_GPDMA1_REQUEST_TIM2_CH3
  *         @arg @ref LL_GPDMA1_REQUEST_TIM2_CH4
  *         @arg @ref LL_GPDMA1_REQUEST_TIM2_UP
  *         @arg @ref LL_GPDMA1_REQUEST_TIM3_CH1
  *         @arg @ref LL_GPDMA1_REQUEST_TIM3_CH2
  *         @arg @ref LL_GPDMA1_REQUEST_TIM3_CH3
  *         @arg @ref LL_GPDMA1_REQUEST_TIM3_CH4
  *         @arg @ref LL_GPDMA1_REQUEST_TIM3_UP
  *         @arg @ref LL_GPDMA1_REQUEST_TIM3_TRIG
  *         @arg @ref LL_GPDMA1_REQUEST_TIM4_CH1 (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM4_CH2 (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM4_CH3 (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM4_CH4 (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM4_UP (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM5_CH1 (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM5_CH2 (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM5_CH3 (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM5_CH4 (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM5_UP  (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM5_TRIG (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM15_CH1 (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM15_UP (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM15_TRIG (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM15_COM (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM16_CH1 (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM16_UP  (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM17_CH1 (*)
  *         @arg @ref LL_GPDMA1_REQUEST_TIM17_UP  (*)
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM1_IC1
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM1_IC2
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM1_UE
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM2_IC1
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM2_IC2
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM2_UE
  *         @arg @ref LL_GPDMA1_REQUEST_DCMI (*)
  *         @arg @ref LL_GPDMA1_REQUEST_AES_OUT (*)
  *         @arg @ref LL_GPDMA1_REQUEST_AES_IN  (*)
  *         @arg @ref LL_GPDMA1_REQUEST_HASH_IN
  *         @arg @ref LL_GPDMA1_REQUEST_UCPD1_RX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_UCPD1_TX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_CORDIC_READ (*)
  *         @arg @ref LL_GPDMA1_REQUEST_CORDIC_WRITE (*)
  *         @arg @ref LL_GPDMA1_REQUEST_FMAC_READ (*)
  *         @arg @ref LL_GPDMA1_REQUEST_FMAC_WRITE (*)
  *         @arg @ref LL_GPDMA1_REQUEST_SAES_OUT (*)
  *         @arg @ref LL_GPDMA1_REQUEST_SAES_IN (*)
  *         @arg @ref LL_GPDMA1_REQUEST_I3C1_RX
  *         @arg @ref LL_GPDMA1_REQUEST_I3C1_TX
  *         @arg @ref LL_GPDMA1_REQUEST_I3C1_TC
  *         @arg @ref LL_GPDMA1_REQUEST_I3C1_RS
  *         @arg @ref LL_GPDMA1_REQUEST_I2C4_RX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_I2C4_TX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM3_IC1 (*)
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM3_IC2 (*)
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM3_UE (*)
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM5_IC1 (*)
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM5_IC2 (*)
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM5_UE (*)
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM6_IC1 (*)
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM6_IC2 (*)
  *         @arg @ref LL_GPDMA1_REQUEST_LPTIM6_UE (*)
  *         @arg @ref LL_GPDMA1_REQUEST_I3C2_RX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_I3C2_TX (*)
  *         @arg @ref LL_GPDMA1_REQUEST_I3C2_TC (*)
  *         @arg @ref LL_GPDMA1_REQUEST_I3C2_RS (*)
  *
  *         @arg @ref LL_GPDMA2_REQUEST_ADC1
  *         @arg @ref LL_GPDMA2_REQUEST_ADC2 (*)
  *         @arg @ref LL_GPDMA2_REQUEST_DAC1_CH1
  *         @arg @ref LL_GPDMA2_REQUEST_DAC1_CH2
  *         @arg @ref LL_GPDMA2_REQUEST_TIM6_UP
  *         @arg @ref LL_GPDMA2_REQUEST_TIM7_UP
  *         @arg @ref LL_GPDMA2_REQUEST_SPI1_RX
  *         @arg @ref LL_GPDMA2_REQUEST_SPI1_TX
  *         @arg @ref LL_GPDMA2_REQUEST_SPI2_RX
  *         @arg @ref LL_GPDMA2_REQUEST_SPI2_TX
  *         @arg @ref LL_GPDMA2_REQUEST_SPI3_RX
  *         @arg @ref LL_GPDMA2_REQUEST_SPI3_TX
  *         @arg @ref LL_GPDMA2_REQUEST_I2C1_RX
  *         @arg @ref LL_GPDMA2_REQUEST_I2C1_TX
  *         @arg @ref LL_GPDMA2_REQUEST_I2C2_RX
  *         @arg @ref LL_GPDMA2_REQUEST_I2C2_TX
  *         @arg @ref LL_GPDMA2_REQUEST_I2C3_RX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_I2C3_TX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_USART1_RX
  *         @arg @ref LL_GPDMA2_REQUEST_USART1_TX
  *         @arg @ref LL_GPDMA2_REQUEST_USART2_RX
  *         @arg @ref LL_GPDMA2_REQUEST_USART2_TX
  *         @arg @ref LL_GPDMA2_REQUEST_USART3_RX
  *         @arg @ref LL_GPDMA2_REQUEST_USART3_TX
  *         @arg @ref LL_GPDMA2_REQUEST_UART4_RX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_UART4_TX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_UART5_RX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_UART5_TX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_USART6_RX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_USART6_TX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_UART7_RX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_UART7_TX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_UART8_RX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_UART8_TX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_UART9_RX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_UART9_TX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_USART10_RX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_USART10_TX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_USART11_RX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_USART11_TX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_UART12_RX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_UART12_TX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_LPUART1_RX
  *         @arg @ref LL_GPDMA2_REQUEST_LPUART1_TX
  *         @arg @ref LL_GPDMA2_REQUEST_SPI4_RX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_SPI4_TX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_SPI5_RX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_SPI5_TX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_SPI6_RX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_SPI6_TX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_SAI1_A (*)
  *         @arg @ref LL_GPDMA2_REQUEST_SAI1_B (*)
  *         @arg @ref LL_GPDMA2_REQUEST_SAI2_A (*)
  *         @arg @ref LL_GPDMA2_REQUEST_SAI2_B (*)
  *         @arg @ref LL_GPDMA2_REQUEST_OCTOSPI1 (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM1_CH1
  *         @arg @ref LL_GPDMA2_REQUEST_TIM1_CH2
  *         @arg @ref LL_GPDMA2_REQUEST_TIM1_CH3
  *         @arg @ref LL_GPDMA2_REQUEST_TIM1_CH4
  *         @arg @ref LL_GPDMA2_REQUEST_TIM1_UP
  *         @arg @ref LL_GPDMA2_REQUEST_TIM1_TRIG
  *         @arg @ref LL_GPDMA2_REQUEST_TIM1_COM
  *         @arg @ref LL_GPDMA2_REQUEST_TIM8_CH1 (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM8_CH2 (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM8_CH3 (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM8_CH4 (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM8_UP  (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM8_TRIG (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM8_COM (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM2_CH1
  *         @arg @ref LL_GPDMA2_REQUEST_TIM2_CH2
  *         @arg @ref LL_GPDMA2_REQUEST_TIM2_CH3
  *         @arg @ref LL_GPDMA2_REQUEST_TIM2_CH4
  *         @arg @ref LL_GPDMA2_REQUEST_TIM2_UP
  *         @arg @ref LL_GPDMA2_REQUEST_TIM3_CH1
  *         @arg @ref LL_GPDMA2_REQUEST_TIM3_CH2
  *         @arg @ref LL_GPDMA2_REQUEST_TIM3_CH3
  *         @arg @ref LL_GPDMA2_REQUEST_TIM3_CH4
  *         @arg @ref LL_GPDMA2_REQUEST_TIM3_UP
  *         @arg @ref LL_GPDMA2_REQUEST_TIM3_TRIG
  *         @arg @ref LL_GPDMA2_REQUEST_TIM4_CH1 (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM4_CH2 (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM4_CH3 (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM4_CH4 (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM4_UP (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM5_CH1 (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM5_CH2 (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM5_CH3 (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM5_CH4 (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM5_UP  (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM5_TRIG (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM15_CH1 (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM15_UP (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM15_TRIG (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM15_COM (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM16_CH1 (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM16_UP  (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM17_CH1 (*)
  *         @arg @ref LL_GPDMA2_REQUEST_TIM17_UP  (*)
  *         @arg @ref LL_GPDMA2_REQUEST_LPTIM1_IC1
  *         @arg @ref LL_GPDMA2_REQUEST_LPTIM1_IC2
  *         @arg @ref LL_GPDMA2_REQUEST_LPTIM1_UE
  *         @arg @ref LL_GPDMA2_REQUEST_LPTIM2_IC1
  *         @arg @ref LL_GPDMA2_REQUEST_LPTIM2_IC2
  *         @arg @ref LL_GPDMA2_REQUEST_LPTIM2_UE
  *         @arg @ref LL_GPDMA2_REQUEST_DCMI (*)
  *         @arg @ref LL_GPDMA2_REQUEST_AES_OUT (*)
  *         @arg @ref LL_GPDMA2_REQUEST_AES_IN  (*)
  *         @arg @ref LL_GPDMA2_REQUEST_HASH_IN
  *         @arg @ref LL_GPDMA2_REQUEST_UCPD1_RX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_UCPD1_TX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_CORDIC_READ (*)
  *         @arg @ref LL_GPDMA2_REQUEST_CORDIC_WRITE (*)
  *         @arg @ref LL_GPDMA2_REQUEST_FMAC_READ (*)
  *         @arg @ref LL_GPDMA2_REQUEST_FMAC_WRITE (*)
  *         @arg @ref LL_GPDMA2_REQUEST_SAES_OUT (*)
  *         @arg @ref LL_GPDMA2_REQUEST_SAES_IN (*)
  *         @arg @ref LL_GPDMA2_REQUEST_I3C1_RX
  *         @arg @ref LL_GPDMA2_REQUEST_I3C1_TX
  *         @arg @ref LL_GPDMA2_REQUEST_I3C1_TC
  *         @arg @ref LL_GPDMA2_REQUEST_I3C1_RS
  *         @arg @ref LL_GPDMA2_REQUEST_I2C4_RX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_I2C4_TX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_LPTIM3_IC1 (*)
  *         @arg @ref LL_GPDMA2_REQUEST_LPTIM3_IC2 (*)
  *         @arg @ref LL_GPDMA2_REQUEST_LPTIM3_UE (*)
  *         @arg @ref LL_GPDMA2_REQUEST_LPTIM5_IC1 (*)
  *         @arg @ref LL_GPDMA2_REQUEST_LPTIM5_IC2 (*)
  *         @arg @ref LL_GPDMA2_REQUEST_LPTIM5_UE (*)
  *         @arg @ref LL_GPDMA2_REQUEST_LPTIM6_IC1 (*)
  *         @arg @ref LL_GPDMA2_REQUEST_LPTIM6_IC2 (*)
  *         @arg @ref LL_GPDMA2_REQUEST_LPTIM6_UE (*)
  *         @arg @ref LL_GPDMA2_REQUEST_I3C2_RX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_I3C2_TX (*)
  *         @arg @ref LL_GPDMA2_REQUEST_I3C2_TC (*)
  *         @arg @ref LL_GPDMA2_REQUEST_I3C2_RS (*)
  *
  * @note   (*) Availability depends on devices.
  */
__STATIC_INLINE  uint32_t LL_DMA_GetPeriphRequest(const DMA_TypeDef *DMAx, uint32_t Channel)
{
  uint32_t dma_base_addr = (uint32_t)DMAx;
  return (READ_BIT(((DMA_Channel_TypeDef *)(dma_base_addr + LL_DMA_CH_OFFSET_TAB[Channel]))->CTR2, DMA_CTR2_REQSEL));
}

/**
  * @brief Set hardware trigger.
  * @note  This API is used for all available DMA channels.
  * @rmtoll CTR2         TRIGSEL     LL_DMA_SetHWTrigger
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_0
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  *         @arg @ref LL_DMA_CHANNEL_7
  * @param  Trigger This parameter can be one of the following values:
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTI_LINE0
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTI_LINE1
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTI_LINE2
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTI_LINE3
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTI_LINE4
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTI_LINE5
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTI_LINE6
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTI_LINE7
  *         @arg @ref LL_GPDMA1_TRIGGER_TAMP_TRG1
  *         @arg @ref LL_GPDMA1_TRIGGER_TAMP_TRG2
  *         @arg @ref LL_GPDMA1_TRIGGER_TAMP_TRG3 (*)
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM1_CH1
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM1_CH2
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM2_CH1
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM2_CH2
  *         @arg @ref LL_GPDMA1_TRIGGER_RTC_ALRA_TRG
  *         @arg @ref LL_GPDMA1_TRIGGER_RTC_ALRB_TRG
  *         @arg @ref LL_GPDMA1_TRIGGER_RTC_WUT_TRG
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH0_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH1_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH2_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH3_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH4_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH5_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH6_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH7_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA2_CH0_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA2_CH1_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA2_CH2_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA2_CH3_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA2_CH4_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA2_CH5_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA2_CH6_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA2_CH7_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM2_TRGO
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM15_TRGO
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM12_TRGO
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM3_CH1
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM3_CH2
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM4_AIT
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM5_CH1
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM5_CH2
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM6_CH1
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM6_CH2
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM15_TRGO (*)
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM12_TRGO (*)
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM3_CH1 (*)
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM3_CH2 (*)
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM4_AIT (*)
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM5_CH1 (*)
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM5_CH2 (*)
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM6_CH1 (*)
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM6_CH2 (*)
  *         @arg @ref LL_GPDMA1_TRIGGER_COMP1_OUT (*)
  *         @arg @ref LL_GPDMA1_TRIGGER_EVENTOUT (*)
  *
  *         @arg @ref LL_GPDMA2_TRIGGER_EXTI_LINE0
  *         @arg @ref LL_GPDMA2_TRIGGER_EXTI_LINE1
  *         @arg @ref LL_GPDMA2_TRIGGER_EXTI_LINE2
  *         @arg @ref LL_GPDMA2_TRIGGER_EXTI_LINE3
  *         @arg @ref LL_GPDMA2_TRIGGER_EXTI_LINE4
  *         @arg @ref LL_GPDMA2_TRIGGER_EXTI_LINE5
  *         @arg @ref LL_GPDMA2_TRIGGER_EXTI_LINE6
  *         @arg @ref LL_GPDMA2_TRIGGER_EXTI_LINE7
  *         @arg @ref LL_GPDMA2_TRIGGER_TAMP_TRG1
  *         @arg @ref LL_GPDMA2_TRIGGER_TAMP_TRG2
  *         @arg @ref LL_GPDMA2_TRIGGER_TAMP_TRG3 (*)
  *         @arg @ref LL_GPDMA2_TRIGGER_LPTIM1_CH1
  *         @arg @ref LL_GPDMA2_TRIGGER_LPTIM1_CH2
  *         @arg @ref LL_GPDMA2_TRIGGER_LPTIM2_CH1
  *         @arg @ref LL_GPDMA2_TRIGGER_LPTIM2_CH2
  *         @arg @ref LL_GPDMA2_TRIGGER_RTC_ALRA_TRG
  *         @arg @ref LL_GPDMA2_TRIGGER_RTC_ALRB_TRG
  *         @arg @ref LL_GPDMA2_TRIGGER_RTC_WUT_TRG
  *         @arg @ref LL_GPDMA2_TRIGGER_GPDMA1_CH0_TCF
  *         @arg @ref LL_GPDMA2_TRIGGER_GPDMA1_CH1_TCF
  *         @arg @ref LL_GPDMA2_TRIGGER_GPDMA1_CH2_TCF
  *         @arg @ref LL_GPDMA2_TRIGGER_GPDMA1_CH3_TCF
  *         @arg @ref LL_GPDMA2_TRIGGER_GPDMA1_CH4_TCF
  *         @arg @ref LL_GPDMA2_TRIGGER_GPDMA1_CH5_TCF
  *         @arg @ref LL_GPDMA2_TRIGGER_GPDMA1_CH6_TCF
  *         @arg @ref LL_GPDMA2_TRIGGER_GPDMA1_CH7_TCF
  *         @arg @ref LL_GPDMA2_TRIGGER_GPDMA2_CH0_TCF
  *         @arg @ref LL_GPDMA2_TRIGGER_GPDMA2_CH1_TCF
  *         @arg @ref LL_GPDMA2_TRIGGER_GPDMA2_CH2_TCF
  *         @arg @ref LL_GPDMA2_TRIGGER_GPDMA2_CH3_TCF
  *         @arg @ref LL_GPDMA2_TRIGGER_GPDMA2_CH4_TCF
  *         @arg @ref LL_GPDMA2_TRIGGER_GPDMA2_CH5_TCF
  *         @arg @ref LL_GPDMA2_TRIGGER_GPDMA2_CH6_TCF
  *         @arg @ref LL_GPDMA2_TRIGGER_GPDMA2_CH7_TCF
  *         @arg @ref LL_GPDMA2_TRIGGER_TIM2_TRGO
  *         @arg @ref LL_GPDMA2_TRIGGER_TIM15_TRGO
  *         @arg @ref LL_GPDMA2_TRIGGER_TIM12_TRGO
  *         @arg @ref LL_GPDMA2_TRIGGER_LPTIM3_CH1
  *         @arg @ref LL_GPDMA2_TRIGGER_LPTIM3_CH2
  *         @arg @ref LL_GPDMA2_TRIGGER_LPTIM4_AIT
  *         @arg @ref LL_GPDMA2_TRIGGER_LPTIM5_CH1
  *         @arg @ref LL_GPDMA2_TRIGGER_LPTIM5_CH2
  *         @arg @ref LL_GPDMA2_TRIGGER_LPTIM6_CH1
  *         @arg @ref LL_GPDMA2_TRIGGER_LPTIM6_CH2
  *         @arg @ref LL_GPDMA2_TRIGGER_TIM15_TRGO (*)
  *         @arg @ref LL_GPDMA2_TRIGGER_TIM12_TRGO (*)
  *         @arg @ref LL_GPDMA2_TRIGGER_LPTIM3_CH1 (*)
  *         @arg @ref LL_GPDMA2_TRIGGER_LPTIM3_CH2 (*)
  *         @arg @ref LL_GPDMA2_TRIGGER_LPTIM4_AIT (*)
  *         @arg @ref LL_GPDMA2_TRIGGER_LPTIM5_CH1 (*)
  *         @arg @ref LL_GPDMA2_TRIGGER_LPTIM5_CH2 (*)
  *         @arg @ref LL_GPDMA2_TRIGGER_LPTIM6_CH1 (*)
  *         @arg @ref LL_GPDMA2_TRIGGER_LPTIM6_CH2 (*)
  *         @arg @ref LL_GPDMA2_TRIGGER_COMP1_OUT (*)
  *         @arg @ref LL_GPDMA2_TRIGGER_EVENTOUT (*)
  *
  * @note   (*) Availability depends on devices.
  * @retval None.
  */
__STATIC_INLINE void LL_DMA_SetHWTrigger(const DMA_TypeDef *DMAx, uint32_t Channel, uint32_t Trigger)
{
  uint32_t dma_base_addr = (uint32_t)DMAx;
  MODIFY_REG(((DMA_Channel_TypeDef *)(dma_base_addr + LL_DMA_CH_OFFSET_TAB[Channel]))->CTR2, DMA_CTR2_TRIGSEL,
             (Trigger << DMA_CTR2_TRIGSEL_Pos) & DMA_CTR2_TRIGSEL);
}

